{"success":true,"rows":[{"id":30,"titulo":"A Experiência Mais Louca da Psicologia","dono":"Apolenario","artigo":"David Reimer e o experimento mais polemico da historia da Psicologia"},{"id":29,"titulo":"Modern JavaScript","dono":"yccp","artigo":"Fala galeraaa, hoje estou aqui, para falar sobre JavaScript, então simbora.\n<br/>\n<p>\nBom, inicialmente quando JavaScript surgiu, ele foi usado apenas para pequenas interações com o usuário antes de fazer requisição para o servidor. Anos após surgiu o jQuery, e passou a ser mais usado que o próprio JavaScript puro pela facilidade.\n</p>\n<p>\n\n\nCom o tempo passando a web evoluindo, a linguagem também conforme esperado. Em 2009 foi lançado o famoso ES5 o começo da revolução da linguagem, atualmente na versão ES8, a linguagem além de ter crescido em tamanho e usabilidade, ganhou também muito mercado.\n</p>\n<p>\n\n\nAtualmente uma das linguagens mais utilizadas no mundo, ela se tornou CROSS PLATFORM LANGUAGE, linguagem multi plataforma, hoje conseguimos desenvolver para mobile usando JavaScript com ionic,react native por exemplo, conseguimos também criar back-end app com o node.js, além do famoso front-end com javascript puro ou usando um dos vários frameworks disponíveis. Também podemos criar aplicações desktop usando html,javascript e css com o espetacular node-webkit conhecido também por NW.js(o qual vou escrever um artigo em breve) e através dele conseguimos criar arquivos executáveis para Windows,Mac e Linux, para assim poder utiliza-los sem precisar instalar nada além de seu programa. Por isso JavaScript é a linguagem mais utilizada no momento.\n</p>\n<p>\nPara você que teve interesse em aprender, que tem interesse na curva de aprendizagem desta linda linguagem, aqui vai.\nBom sobre curva de aprendizagem isso é algo bem relativo, existem aqueles que falam que é grande, outros que é curta, na minha opinião, se vc ja conhece o paradigma funcional, sua curva de aprendizagem vai ser mediana, mas pra mais curta, caso você não conheça, você terá um pouco mais de dificuldade para escrever códigos porém ainda assim a sua curva de aprendizagem na minha opinião é mediana quase longa. O problema do JavaScript são 2, o assíncrono, porque pra quem não está acostumado com códigos assim, e o segundo é o seu paradigma que é o pior deles, para você aproveitar melhor uma linguagem, fazer códigos que usem as vantagens da linguagem devemos conhecer bem os paradigmas, e o funcional não é muito falado e nem costuma ter muitos materiais sobre em português, embora não seja tão complexo e ser uma variação da orientação a objetos, com mudanças muito importantes para o meio do javascript, acaba sendo a maior dificuldade. Se tem interesse em aprender JavaScript, vale a pena dar uma estudada leve no paradigma. Para cursos, eu vou sugerir alguns gratuitos que é o curso de angular 2+ da Loiane groner, e de ionic 3, desenvolvimento mobile com JavaScript https://www.udemy.com/ionic-3-para-iniciantes/learn/v4/content. Embora eu só recomende esses dois (foram os que me lembro), tem vários cursos de qualidade na internet sobre varios frameworks ou mesmo JavaScript puro na internet, gratuitos e pagos, é isso ai galera, let’s code, let’s code in JS\n</p>"},{"id":28,"titulo":"Nw.js build desktop applications with JavaScript","dono":"yccp","artigo":"<p>Fala galera, tudo tranqs? Espero que sim, hoje irei falar sobre nw.js (node webkit) e um pouquinho bem básico sobre polymer\n  também. Bom o nw.js é uma ferramenta para desenvolvimento para desktop com JavaScript, usando o node e um engine do chromium\n  a versão open source do Google Chrome, através disso fazemos aplicações desktop usando javascript html e css, ou mesmo\n  usando frameworks como angular,react através do build gerado para rodar no navegador, claro que nem todos recursos estão\n  disponível precisamos olhar se esse recurso está disponível no chromium. Para rodarmos precisamos do node.js\n</p>\n<p>\n  Já o polymer é uma biblioteca js do google para criação nativa de web components, atualmente na versão2.0 e a3.0 a caminho\n  é um framework criado para facilitar a criação de web components para se aprofundar mais em Polymer tem estas2 palestras\n  muito boas esta <a>https://speakerdeck.com/yanmagale/number-usetheplatfom-levando-suas-aplicacoes-ao-proximo-nivel-com-polymer-1</a>\n  do Yan Magalhães e também tem esta <a>https://speakerdesck.com/afonsopacifer/polymer-project-state-of-union</a>a do Afonso Pacifer.\n  Sem mais delongas vamos a parte que interessa.</p>\n<p>\n  Para criarmos nosso primeiro projeto com nw, vamos criar uma pasta com o nome que você quiser, no meu caso nwProject e dentro\n  dela vamos criar um arquivo html e o package.json no package escreva:\n  <br/>{ “version”: “1.0.0”, “main”:”index.html”, “name”:”nwproject” }\n  <br/> No nosso caso de exemplo vamos usar um carrosel feito em polymer por isso vamos na pasta que criamos, assumindo que você\n  já tem o node instalado, e que tem o bower também instalado caso tenha node e não tenha o bower basta instalar usando\n  <span\n    style=\"background:#696969;font-weight: bold\"> npm install -g bower </span>. Para instalarmos esse carrosel vamos usar o comando\n    <span style=\"background:#696969;font-weight: bold\">bower install --save FabricElements/skeleton-carousel#^1.0.0</span> . <a href=\"https://github.com/yanccprogramador/nwProject/blob/master/index.html\"> colocamos no html o  codigo deste link</a>\n    Para rodar, antes precisamos colocar3 imagens numa pasta chamada img dentro da pasta do projeto e com os nomes igual\n    do html, ou mudar no html para as que você quiser. Após todo projeto pronto para rodar vamos instalar o\n    <span style=\"background:#696969;font-weight: bold\">nw npm install -g</span> nw após instalado, vamos rodar\n    <span style=\"background:#696969;font-weight: bold\">nw .</span> isso com terminal ou cmd conforme seu sistema operacional, vai rodar o comando dentro da pasta. e Irá abrir\n    uma programa assim:\n    <br/>\n    <img src=\"https://cdn-images-1.medium.com/max/800/1*kZVk0Se_pcQYLLnISYZQOw.jpeg\">\n</p>\n<p>\n  Agora que você já sabe criar uma aplicação em nw.js vamos aprender a criar uma distribuição, para isso vamos instalar o\n  <span\n    style=\"background:#696969;font-weight: bold\"> nw-builder npm install -g nw-builder</span> e para gerar para linux32 e64 windows 32e 64 e mac32 e64 vamos usar\n    <span style=\"background:#696969;font-weight: bold\">nwbuilder -p win32,win64,linux32,linux64,osx32,osx64 -f -o dist </span>. então ele irá gerar uma pasta com arquivos necessários\n    e o executável para cada so na pasta dist.\n</p>\n<p>\n  Por hoje é tudo,obrigado por ler, e qualquer dúvida só me perguntar que estou disposto a ajudar, e aceito feedbacks e agradeço.\n  Então simbora pessoal, let’s code\n</p>\nPara ver todo o código acesse\n<a>https://github.com/yanccprogramador/nwProject</a>"},{"id":27,"titulo":"Assynchronous JavaScript","dono":"yccp","artigo":"<p>Cara você pensa em assíncrono, nossa cara que lindo. Como dizem magic kkk.</p><br/>\n<img align=\"center\" src=\"https://cdn-images-1.medium.com/max/800/1*ljTFIMmjzU5_IxkLssllAA.gif\"/><br/>\nPro usuário mais ainda, é algo que melhora a vida dele, muito mesmo. Agora para um programador, pode se tornar algo traiçoeiro.</p>\n\n<p>\nPor quê? Cara tem hora que a gente escreve um código que acaba dando algum erro, e sinceramente, pelo menos eu, se deu erro eu procuro algum erro no código, não se é algo assincrono, e ai que ta o perigo, cara se vc por algum motivo escreveu um código que não foi bem tratado na parte assincrona, rapaz vc vai ter um trabalhinho para conseguir achar o erro, enquanto vc não procurar analisar o código se ta feito bem o assincrono, você não vai achar o erro.\n</p>\n\n<p>\nÉ uma maravilha sim, pro usuário nem se fala, mas pode ser traiçoeiro. Uma dica antes de procurar um erro de código, procure ter certeza que ta feito assincrono, e não, não desista do assincrono ele tem um poder fenomenal. É isso ai pessoal.Valeu, e codem assincrono.\n</p>"},{"id":26,"titulo":"svvvss","dono":"teste","artigo":"aaaaaa"},{"id":25,"titulo":"TI e suas injustiças!","dono":"yccp","artigo":"<p>Um dia dois amigos(Yan Magalhães,Junior Grossi) estavam comentando, que, um profissional de Ti não pode ficar muito tempo em uma mesma empresa, acaba tornando como sua zona de conforto, e tira a competitividade no mercado, pois deixa de procurar novos conhecimentos.</p>\n<p>Eu andei pensando nisso uns dias atrás, e sinceramente é a mais pura verdade. Quando devemos mudar então? quando nos sentirmos desvalorizados, ou seja, quando você for um dos melhores naquilo, quando isto não for mais um desafio para você. E exatamente nesse momento que eu me encontro, não me sinto valorizado, nem sequer motivado para fazer o trabalho que faço hoje. Necessito de novos desafios, algo que me proporcione novos aprendizados, que me faça crescer.</p>\n<p>E ai que entra grande parte das injustiças da área, alguém com pouca experiência é cortado de metade das vagas(no mínimo), você se esforça , estuda por fora, adquire novos conhecimentos, mas isso não é valorizado, empresas precisam aprender que 1,2,3,4 anos de experiência comprovado em um curriculum, não torna ninguém mais capacitado, as vezes alguém que não tem isso pode produzir o mesmo. <b>Experiência não é tudo</b>. As vezes o que falta, é exatamente uma oportunidade. Nem sempre, quem não possui essas experiências vai ser tão capaz, mas algumas vezes sim, ou inclusive essa pessoa pode produzir ainda mais, por querer mostrar seu valor, por estar motivado, por realmente se esforçar, coisa que quem já tem experiência não se preocupa tanto. Mas nosso mercado é assim, não só o nosso, mas no nosso é onde tudo que reforço faz mais sentido.</p>\n\n\nps: Estou aberto a  novas opiniões sobre também, afinal não sei tudo, nem sou melhor que ninguém, porém essa é a minha opinião.Talvez uma oportunidade é o que falta a várias pessoas."},{"id":24,"titulo":"Year Facebook class","dono":"yccp","artigo":"<b>Year Class Library byFacebook</b>\n\nBuilding for the next billion users using the Year Class Library.\n\nI am writing this article as I have seen many of us are not aware ofthis useful library.\n\nThe current user-base has around more than 10k different handsets. So you never know how your application is going to behave on different Android phones. These handsets have different sizes of Ram, different number of CPU, etc. So on fewer handsets, your application runs fast and on the rest, it runs very slow. Although we must optimize these things, we can also write different logic for different handsets.\n\nFor writing different logic for different devices, we must know the categorization of the devices. So, this is where Facebooks Year Class library comes in picture.\n\nfacebook/device-year-class\ndevice-year-class - A library that analyzes an Android device's specifications and calculates which year the devicegithub.com\n\nThe Year Class does the categorisation on the basis of the following specifications:\n\nRam\n\nNumber of CPU\n\nMax CPU Frequency\n\nFacebook have clustered every phone into a group of similarly capable devices to make understanding performance easier using the above three specifications. Facebook calls this concept year classessentially, in what year would a given device have been considered high end?.\n\n\n\nsource facebook\n\nNow, how to use thislibrary?\n\nAdd this to your apps build.gradle\n\ncompile 'com.facebook.device.yearclass:yearclass:x.x.x'\n\nThen, get the year like below:\n\nint year = YearClass.get(getApplicationContext());\n\nAfter that, we can use this as below:\n\nif (year >= 2013) {\n// Do advanced animation\n} else if (year > 2010) {\n// Do simple animation\n} else {\n// too slow, don't do any animations\n}\n\nMore things that we can do with this library are:\n\nDecides whether to play video or not as low-end phones cannot play it smoothly.\n\nPrioritize showing the things that work best on that phone.\n\nDecide how much content to load on that particular phone.\n\nand much more.\n\nWith great power, comes great responsibility. So use it in the best way.\n\nHappy Coding:)\n\nThanks for reading this article. Be sure to click  below to recommend this article if you found it helpful. It means a lot to me.\n\nFor more about programming, follow me andMindorks, so youll get notified when we write new posts.\n\nJoin The Mindorks Community And Learn From Each Other.\n\nAlso, Lets become friends onTwitter,Linkedin,GithubandFacebook."},{"id":23,"titulo":"Malware Linux ","dono":"yccp","artigo":"Pesquisadores de malware do fabricante de antivírus russo Dr. Web descobriram um novo Trojan para Linux, rastreado como KinuX.MulDrop.14, que está infectando dispositivos Raspberry Pi com a finalidade de minerar cryptocurrency. De acordo com a Dr. Web, o malware foi visto pela primeira vez online em maio; os pesquisadores descobriram um script contendo um aplicação compactada e criptografada.O malware KinuX.MulDrop.14 tem como alvo dispositivos Raspberry Pi não protegidos que possuem portas SSH abertas para conexões externas. Uma vez que o malware infecta o dispositivo, ele irá primeiro alterar a senha da conta pi. Em seguida, o malware desliga vários processos e instala bibliotecas como ZMap e SSHPass que ele usa para suas operações.O Trojan Linux que é um script bash contendo um programa de mineração, que é compactado com gzip e criptografado com base64. Uma vez iniciado, o script encerra vários processos e instala bibliotecas necessárias para sua operação, afirmou a análise publicada pela Dr Web.Ele muda a senha do usuário. O malware, em seguida, inicia um processo de mineração cryptocurrency, mas usa o ZMap para digitalizar a Internet para infectar outros dispositivos.Toda vez que o malware encontra um dispositivo de Raspberry Pi na Internet, ele usa o sshpass para tentar fazer logon usando o nome de usuário padrão pi e a senha raspiberry.O código malicioso só tenta usar esse par de valores. Isso sugere que o malware alveja apenas dispositivos Raspberry Pi. Especialistas acreditam que o malware poderia ser melhorado e que pode ser usado nas próximas semanas para atingir outras plataformas. Os pesquisadores também analisaram um segundo malware para Linux, apelidado de Linux.ProxyM que foi usado para criar uma rede proxy. O código malicioso inicia um servidor proxy SOCKS em dispositivos infectados usados para retransmitir o tráfego malicioso, disfarçando sua real fonte. O outro Trojan foi nomeado de Linux.ProxyM. ataques envolvendo este trojan foram observados desde Fevereiro de 2017, mas atingiram o pico no final de Maio. O gráfico abaixo mostra quantos ataques foram feitas pelo Linux.ProxyM e identificados pelos especialistas da Doctor Web, afirmou a Dr. Web.  referência https://imasters.com.br/infra/seguranca/malware-linux-foca-em-equipamentos-raspberry-pi-para-mineracao-de-cryptocurrency"},{"id":22,"titulo":"Os maiores problemas do Mercado de TI!","dono":"yccp","artigo":"<h4><b>Quais os maiores problemas do Mercado de TI?</b></h4><br/>\n<p>Bom, existem N problemas no mercado de TI e isto não é novidade para ninguém, porém isso não é exclusividade do nosso mercado, pois, está presente em todos os mercados. Ainda assim, é um dos melhores mercados da atualidade, e que, ainda está no começo, poucos profissionais, o que por sua vez torna mais fácil de conseguir uma vaga (para quem já está dentro da área). Também é um mercado desvalorizado em algumas regiões do país, que é <b>uma dos maiores problemas</b>, no entanto, eu, defendo que, o maior problema é <b> a dificuldade para entrar</b>.</p>\n<h4><b>Porque este problema?</b></h4></br>\n<p> É algo difícil de se explicar, mas, eu entendo que, o maior motivo para quem contrata é, devido a escassez de profissionais, a desvalorização do trabalho e por fim, a grande quantidade de projetos para se fazer, com quantidade de tempo reduzida, torna mais viável, contratar alguém com experiência( não necessariamente alguém pleno ou sênior). Podem e devem existir outros motivos também, só que hoje não sei mais falar quais. Esse motivo é algo que traz revolta, devido à que se ninguém da experiência como que alguém vai ter experiência para ser contratado, mas, as empresas não veem isso, então iniciantes o que resta é pegar alguns freelance, fazer projetos e postar no GitHub, e esperar a oportunidade.</p> "},{"id":21,"titulo":"Startup sem fronteira","dono":"yccp","artigo":"<b> As startups estao em alta</b>\n\nO mercado das startups esta aquecido, com cada vez mais investimentos e lancamentos de novos produtos. Neste cenario, surge para muitos o desejo de colocar sua ideia em pratica e surfaresta onda. Porem, na pratica, os passos necessarios vao depender de diversos fatores, muitos que sao limitantes para que a ideia realmente chegue ao usuario final.\n\nA startup nem sempre difere muito de uma empresa comum, pois precisa passar por todas as legislacoes do pais onde e aberta, e no Brasil isto nao e diferente. Para comecar um empreendimento sem muita burocracia, temos a opcao deabrir um MEI, que oferece ao microempreendedor individual a oportunidadede comecar qualquer negocio; assim, ele pode se lancar no mercado e atrair investimentos.\n\nTendo sucesso, ele pode de forma escalavel expandir seu negocio. Infelizmente, ele sempre vai se deparar com as burocracias e complicacoes do governo Brasileiro no que diz respeito aos impostos, contratacao de funcionarios e gerencia dos processos de contabilidade. Outro problema que logo surgira e se a empresa trabalha com pagamento, pois ela enfrentara barreiras para oferecer seu servico para o mundo todo.\n\n<b> Como ter uma startup sem fronteiras e regulamentacoes entre paises?</b>\n\nApesar da globalizacao, a facilitacao de negocio entre empresas de diversos paises nao elimina o fato de ter uma empresavinculada a um governo local. OBrasil ainda e um pais imaturo neste quesito, com pouco investimento de fato do governo e pouco estimuloas startups. Abrir uma empresa emum ambienteonde servicos sao compartilhados, e empaises que tem leis facilitadoras para startups,favorecem o seu crescimento.\n\nExistemstartupsque criam servicos para outras startups, e elas se ajudam em um unico ecossistema de servicos interdependentes. Ha empresaspara ajudar na contabilidade, gerenciamento e processos. Desta forma, em um negocio ainda imaturo, voce nao precisa realizar um grande investimento inicial emestrutura.\n\n"},{"id":20,"titulo":"Why using code as DI config is a win!","dono":"yccp","artigo":"In my recent talk on introducing Disco - the DI container with the damn coolest name(tm) - I talk about why I believe that using XML or any other non-code configuration (YAML, JSON, ...) is not a good idea. This stirred some twitter discussion recently which led to this blog post.  Just for the record, for a very long time I was part of the XML camp - just browse my collection of old talks to see for yourself. I praised XML a lot as being the only true DI configuration format. A few years ago when the Spring Framework made its move from \"preferring\" code over XML configuration at first I did not understand it. After dealing with all sorts of problems every now and then, after a few more years, it finally became clear to me. Whilst XML has its good parts - mainly XSD - it comes with its very own set of problems that I want to highlight briefly:  1. An XML editor won't give you code-completion for PHP classes or methods. The configuration is simply treated as text and has \"no meaning\" in a programming sense. One can waste a lot of time looking for spelling mistakes of all kinds in an XML configuration file. Trust me, I wasted a lot of time fixing those issues in the last 12 years.  2. Refactoring won't work properly in an XML configuration file. Whenever I rename a class or move it to a different namespace my IDE will properly update all code occurrences, while the XML configuration will be left as is. I need to run a proper search and replace action manually, maybe with some regex foo to change the needed occurrences. If I make a mistake, I won't notice it immediately. I have to either reload my application or as some fellow developers do, run an \"integration test\" which will try to instantiate each and every dependency the DI container is aware of. This is far, far away from instant developer feedback.  3. An XML editor is not capable of doing proper type checks. I can \"inject\" any kind of dependency that I want. Type errors can be only detected during runtime which means either an application reload or via running the almighty integration tests. Again, as a developer I want instant feedback and not wait for the integration tests to have passed."},{"id":1,"titulo":"Bem Vindo","dono":"yccp","artigo":"<b>Obrigado por nos prestigiar com seu artigo</b>"}],"where":false,"numLinhas":12}